<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PostSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('posts')->insert([
            'title' => 'Україна повернула з полону 22 своїх бійців',
            'category_id' => 2,
            'content' => "Сьогодні з російського полону додому повернулися 22 українських військових.\n
Про це повідомив голова Офісу президента Андрій Єрмак.\n
“Це бійці ЗСУ, з них два офіцери, військовослубовці рядового та сержантського складу. Вони брали участь у боях на різних напрямках, серед звільнених є поранені. Найстаршому з наших воїнів виповнилося 54 роки, наймолодшому — 23 роки”, — йдеться у повідомленні.\n
Зараз всі звільнені бійці відправилися на курс фізичної та психологічної реабілітації, реінтеграції. За необхідності вони отримують потрібне лікування.",
        ]);
        DB::table('posts')->insert([
            'title' => 'Зеленський про атаки на порти України',
            'content' => "Російські кораблі можуть бути знищені до кінця війни у разі, якщо Кремль вирішить і надалі атакувати українські порти.\n
Про це заявив президент України Володимир Зеленський в інтерв'ю латиноамериканським ЗМІ, повідомляє РБК-Україна з посиланням на La Nacion.'n
Глава держави нагадав, що Росія заблокувала Чорне море та, зокрема, територіальні води України. Тому зараз наша країна має довести, що у своїх територіальних водах вона має право ввозити та вивозити товари.",
            'category_id' => 3,
        ]);
        DB::table('posts')->insert([
            'title' => 'Ведення електронних трудових книжок',
            'content' => "Східне міжрегіональне управління Держпраці надало роз'яснення щодо ведення електронних трудових книжок.\n
Так, починаючи з 10 червня 2021 року в Україні офіційно діють електронні трудові книжки як аналог паперових трудових книжок.\n
Роботодавець зобов'язаний надавати відомості про трудову діяльність найманих працівників в електронному форматі, робити записи про прийняття на роботу, переведення чи звільнення, строкову військову службу, інші події.",
            'category_id' => 4,
        ]);
    }
}
