<?php

return [

    'back' => 'Назад',
    'categories' => 'Категорії',
    'category' => 'Категорія',
    'content' => 'Контент',
    'create' => 'Створити',
    'created_at' => 'Створено',
    'delete' => 'Видалити',
    'edit' => 'Редагувати',
    'home_page' => 'Домашня сторінка',
    'post' => 'Повідомлення',
    'posts' => 'Повідомлення',
    'record' => [
        'created' => 'Запис створено',
        'updated' => 'Запис змінено',
        'deleted' => 'Запис видалено',
    ],
    'show' => 'Перегляд',
    'tag' => 'Тег',
    'tags' => 'Теги',
    'title' => 'Заголовок',
    'update' => 'Оновити',
    'updated_at' => 'Змінено',

];
